app/views/partials/_nav.haml

SELECT COUNT(*) FROM "products" INNER JOIN "in_shopping_carts" ON "products"."id" = "in_shopping_carts"."product_id" WHERE "in_shopping_carts"."shopping_cart_id" = ?  [["shopping_cart_id", 1]]
---
					%i.mdi-action-add-shopping-cart
					carrito (
					= @shopping_cart.products.count
					)