app/views/welcome/payment_succed.haml

				%tbody
					-@shopping_cart.in_shopping_carts.each do |i_sh|
---
SELECT "in_shopping_carts".* FROM "in_shopping_carts" WHERE "in_shopping_carts"."shopping_cart_id" = $1  [["shopping_cart_id", 1]]