app/controllers/in_shopping_carts_controller.rb

INSERT INTO "in_shopping_carts" ("product_id", "shopping_cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 1], ["shopping_cart_id", 3], ["created_at", 2017-02-24 20:42:56 UTC], ["updated_at", 2017-02-24 20:42:56 UTC]]
---
	def create
		in_shopping_cart = InShoppingCart.new(product_id: params [:product_id], shopping_cart: @shopping_cart)

		if in_shopping_cart.save

SELECT  "in_shopping_carts".* FROM "in_shopping_carts" WHERE "in_shopping_carts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "in_shopping_carts" WHERE "in_shopping_carts"."id" = $1  [["id", 6]]
---
	def destroy
		@in_shopping_cart = InShoppingCart.find(params[:id])
		@in_shopping_cart.destroy