app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products" ORDER BY pricing

  def create
    @product =current_user_product.new(product_params)
    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "pricing", "description", "stock", "user_id", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at", "categoria") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"